#include <iostream>
#include <locale>
#include <tchar.h>


int _tmain(int argc, _TCHAR* argv[])
{
	unsigned int n; // число, "корень" которого надо найти.
   	unsigned int m; // "корень" числа.
	std::cout << "Введите число: ";
    std::cin >> n;
    m = n;  // Начальное значение "корня" числа
    while (m > 9)  // Внешний цикл: повторять пока число не станет однозначным
    {
        unsigned int s = 0;  // Сумма цифр введённого числа
        while (m > 0)  // Внутренний цикл: повторять пока число больше нуля
        {
            s = s + m % 10;  // Вычислить сумму цифр числа.
            m = m / 10; // Число уменьшить в 10 раз.
        }
        m = s;  // Промежуточное значение "корня" числа
    }
    // Вывод на экран исходного числа и его "корня"
    std::cout << "\"Корень\" числа " << n << " - " << m << "\r\n";
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    std::cin.ignore();
    std::cin.get();
	return 0;
}
